# GetGeometry Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
SpatialElementGeometryResults..::..GetGeometry Method
SpatialElementGeometryResults Class See Also
---
The solid from the spatial element.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public Solid GetGeometry()
```

Visual Basic
---
```text
Public Function GetGeometry As Solid
```

Visual C++
---
```text
public:
Solid^ GetGeometry()
```

# ### Return Value
Requested solid.
# See Also
SpatialElementGeometryResults Class
Autodesk.Revit.DB Namespace